# Текст песни...
# Пирамиды - это потрясающе! Как в архитектурном, так и в математическом смысле. Если у вас есть компьютер, вы можете возиться с пирамидами, даже если вы в это время не находитесь в Египте. 
# Например, давайте рассмотрим следующую проблему. Представьте, что у вас есть пирамида, построенная из чисел, как эта здесь:

# /3/
# \7\ 4
# 2 \4\ 6
# 8 5 \9\ 3
# А вот и задача...
# Предположим, что "слайд вниз" - это максимальная сумма последовательных чисел от вершины до основания пирамиды. Как вы можете видеть, самое длинное "скольжение вниз" - это 3 + 7 + 4 + 9 = 23

# Ваша задача - написать функцию, которая принимает представление пирамиды в качестве аргумента и возвращает ее "самый большой" слайд вниз". Например:

# * С помощью ввода `[[3], [7, 4], [2, 4, 6], [8, 5, 9, 3]]`
# * Ваша функция должна возвращать `23`.
# Кстати...
# Мои тесты включают в себя несколько чрезвычайно высоких пирамид, так что, как вы можете догадаться, метод грубой силы - плохая идея, 
# если у вас нет нескольких столетий, которые можно потратить впустую. Вы должны придумать что-нибудь более умное, чем это.

# (c) Эта задача представляет собой лирическую версию Задачи 18 и /или Задачи 67 на ProjectEuler.


