#Дана строка. Удалите из этой строки все символы @.
s = input('s: ')
print(s.replace('@', ''))