#Дана строка. Замените в этой строке все цифры 1 на слово one.
s = input('s: ')
print(s.replace('1', 'one'))