# На вход программе подаются два натуральных числа n и m — количество строк и
# столбцов в матрице, затем n строк по m целых чисел в каждой,
# отделенных символом пробела.

# Напишите программу, которая находит индексы (строку и столбец)
# первого вхождения максимального элемента.

# Формат входных данных
# На вход программе на разных строках подаются два числа n и m — количество
# строк и столбцов в матрице, затем сами элементы матрицы построчно
# через пробел.

# Формат выходных данных
# Программа должна вывести два числа: номер строки и номер столбца,
# в которых стоит наибольший элемент таблицы. Если таких элементов несколько,
# то выводится тот, у которого меньше номер строки, а если номера строк равны
# то тот, у которого меньше номер столбца.

# Примечание. Считайте, что нумерация строк и столбцов начинается с нуля.

n = int(input())
m = int(input())
matrix = []
for i in range(n):
    matrix.append([int(x) for x in input().split()])
max_el_ind = [matrix[0][0], 0, 0]
for i in range(n):
    for j in range(m):
        if matrix[i][j] > max_el_ind[0]:
            max_el_ind[0] = matrix[i][j]
            max_el_ind[1] = i
            max_el_ind[2] = j
print(max_el_ind[1], max_el_ind[2])
