# Напишите функцию. Которая распечатает 124 раза строку "Почему меня никто
# не предупредил, что на работе нельзя фыркать как лошадка в ухо начальнику?"
# Вызовите функцию.

def func():
    for _ in range(124):
        print("Почему меня никто не предупредил, что на работе нельзя фыркать как лошадка в ухо начальнику?")


func()
