#N кеглей выставили в один ряд, занумеровав их слева направо числами от 1 до N. Затем по этому ряду бросили K шаров, при этом i-й шар сбил все кегли с номерами от li до ri включительно. Определите, какие кегли остались стоять на месте.

#Программа получает на вход количество кеглей N и количество бросков K. Далее идет K пар чисел li, ri, при этом 1≤ li≤ ri≤ N.

#Программа должна вывести последовательность из N символов, где j-й символ есть “I”, если j-я кегля осталась стоять, или “.”, если j-я кегля была сбита.

n, k = [int(i) for i in input().split()]
a = ['I'] * n
for i in range(k):
    li, ri = [int(j) for j in input().split()]
    for j in range(li - 1, ri):
        a[j] = '.'
for i in a:
    print(i, end='')